#include "api.h"

/*****************************************************************************
函 数 名  : OpInit
功能描述  : 需要考生实现的接口,系统初始化
*****************************************************************************/
void OpInit(void)
{
};

/*****************************************************************************
函 数 名  : OpRegister
功能描述  : 需要考生实现的接口,病人挂号
输入参数  : const char *pPatientId 病人ID
*****************************************************************************/
void OpRegister(const char *pPatientId)
{
}
/*****************************************************************************
函 数 名  : OpDiag
功能描述  : 需要考生实现的接口,就诊
*****************************************************************************/
void OpDiag(void)
{
}
/*****************************************************************************
函 数 名  : OpPay
功能描述  : 需要考生实现的接口,缴费
输入参数  : const char *pPatientId 病人ID
*****************************************************************************/
void OpPay(const char *pPatientId)
{

}
/*****************************************************************************
函 数 名  : OpQuery
功能描述  : 需要考生实现的接口,查询
输入参数  : QueryType queryType 查询方式
            const char *pQueryId 医生/病人ID
*****************************************************************************/
void OpQuery(QueryType queryType, const char *pQueryId)
{
}

